{
    "Title": "Machine Learning Engineer",
    "Description": "Role Description:\nWe are seeking a Machine Learning Engineer with approximately 5 years of experience in the field. The ideal candidate will have a strong foundation in low-level machine learning skills, data science, and advanced AI techniques. You will be working with Large Language Models (LLMs), Retrieval-Augmented Generation (RAG), and other state-of-the-art toolchains. Additionally, familiarity with cloud operations will be beneficial. If you are passionate about pushing the boundaries of AI and enjoy working on complex challenges, we want to hear from you!\nKey Responsibilities:\nModel Development: Design, implement, and optimize machine learning models and algorithms, focusing on low-level techniques and cutting-edge AI methodologies.\nData Handling: Develop and maintain data pipelines, perform exploratory data analysis, and apply data preprocessing techniques to ensure high-quality input for machine learning models. LLM & RAG Implementation: Leverage and fine-tune Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG) systems to create innovative solutions and enhance model performance.\nToolchain Expertise: Utilize and integrate modern toolchains and frameworks (e.g., TensorFlow, PyTorch, Hugging Face) to build and deploy machine learning models.\nCloud Operations: Manage and optimize machine learning workflows in cloud environments (e.g., AWS, Google Cloud, Azure), ensuring scalability and efficiency.\nCollaboration: Work closely with cross-functional teams, including data scientists, software engineers, and product managers, to align on project goals and deliver high-impact solutions.\nContinuous Learning: Stay current with the latest advancements in AI and machine learning, and actively contribute to the knowledge base of the team.\nQualifications:\nExperience: Approximately 5 years of professional experience in machine learning and AI engineering.\nTechnical Skills: Proficiency in Python and relevant libraries (e.g., NumPy, pandas, scikit-learn). Strong understanding of machine learning algorithms, statistical analysis, and model evaluation techniques.\nLLMs & RAG: Hands-on experience with Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG) technologies, including fine-tuning and deployment.\nData Science Foundations: Solid background in data science principles, including data preprocessing, feature engineering, and model selection.\nCloud Operations: Experience with cloud platforms (AWS, Google Cloud, Azure) and knowledge of cloud-based machine learning services and deployment strategies.\nToolchain Knowledge: Familiarity with machine learning frameworks and tools (e.g., TensorFlow, PyTorch, Hugging Face Transformers) and version control systems (e.g., Git).\nProblem-Solving: Strong analytical and problem-solving skills, with the ability to tackle complex challenges and derive actionable insights.\nCommunication: Excellent communication skills, with the ability to present technical concepts clearly and effectively to non-technical stakeholders.\nPreferred Qualifications:\nAdvanced Degrees: Master’s or PhD in Computer Science, Data Science, Artificial Intelligence, or a related field.\nResearch Experience: Experience in conducting and publishing research in the field of machine learning or AI.\nCertifications: Relevant certifications in cloud platforms or machine learning.\nBenefits:\nCompetitive salaryEquity in line with company stage and roleComprehensive health, dental, and vision insuranceGenerous PTO and flexible work arrangementsOpportunities for professional growth and developmentCollaborative and inclusive work environment with a passionate and talented team",
    "Primary Description": "Statt  · Austin, TX (Hybrid)",
    "Detail URL": "https://www.linkedin.com/jobs/view/4056026645",
    "Location": "Austin, Texas, United States",
    "Skill": null,
    "Insight": null,
    "Job State": "LISTED",
    "Poster Id": 25195718.0,
    "Company Name": "Statt",
    "Company Logo": "https://media.licdn.com/dms/image/v2/D560BAQFfETfk4CxbTg/company-logo_400_400/company-logo_400_400/0/1720890643158/stattinc_logo?e=1747872000&v=beta&t=qZqFqh9VhdqCJd_c-1X8ujmRHqfnnPtJHcfurZKGQRk",
    "Created At": "2024-10-22 18:15:23",
    "Scraped At": "2025-02-18 02:03:03"
  },
  {
    "Title": "Machine Learning Software Engineer",
    "Description": "Compensation: $120,000 - $140,000/year\n\nLocation: Onsite - Oklahoma City, OK\n\nPosition: Machine Learning Software Engineer\n\nInceed has partnered with a great company to help find a skilled Machine Learning Engineer to join their team!\n\nResponsibilities:\n\nWorking on machine learning projects -- will be both new and maintenance development \n\nRequired Qualifications & Experience:\n\nProfessional experience in a machine learningAI/Machine LearningSoftware Engineering -- open on tech stackSQL ExperienceLinux Experience\n\nPerks & Benefits:\n\nHealth, dental, and vision insurance401K with matchPaid time off and company paid holidaysProfit sharing\n\nIf you are interested in learning more about the Machine Learning Software Engineer opportunity, please submit your resume for consideration. Our client unable to provide sponsorship at this time.\n\nWe are Inceed, a staffing direct placement firm who believes in the possibility of something better. Our mission is simple” We’re here to help every person, whether client, candidate, or employee, find and secure what’s better for them.\n\nInceed is an equal opportunity employer. Inceed prohibits discrimination and harassment of any type and affords equal employment opportunities to employees and applicants without regard to race, color, religion, sex, sexual orientation, gender identity, or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.",
    "Primary Description": "Inceed · Oklahoma City, OK (On-site)",
    "Detail URL": "https://www.linkedin.com/jobs/view/4142506122",
    "Location": "Oklahoma City, Oklahoma, United States",
    "Skill": null,
    "Insight": null,
    "Job State": "LISTED",
    "Poster Id": 640138030.0,
    "Company Name": "Inceed",
    "Company Logo": "https://media.licdn.com/dms/image/v2/C560BAQFeKKclNfQh8w/company-logo_400_400/company-logo_400_400/0/1676503327706/inceed_logo?e=1747872000&v=beta&t=rTsuv_YNCojG9zu1tZfDGmook-4BH73ZZBMbjZB4W0c",
    "Created At": "2025-02-05 18:53:31",
    "Scraped At": "2025-02-18 02:03:03"
  },
  {
    "Title": "Machine Learning Engineer",
    "Description": "Job Description\n\nWe are looking for a Machine Learning Engineer to join our team. The ideal candidate will have a strong background in machine learning, data science, and software engineering. You will be responsible for designing, implementing, and deploying machine learning models and algorithms to solve complex problems.\n\nResponsibilities:\n\nDesign and implement machine learning models and algorithms.\nCollaborate with data scientists and software engineers to develop scalable solutions.\nAnalyze large datasets to extract insights and improve model performance.\nDeploy machine learning models into production environments.\nMonitor and maintain model performance over time.\nStay up-to-date with the latest advancements in machine learning and AI technologies.\n\nQualifications:\n\nBachelor's or Master's degree in Computer Science, Data Science, or a related field.\n3+ years of experience in machine learning and data science.\nStrong programming skills in Python, Java, or C++.\nExperience with machine learning frameworks such as TensorFlow, PyTorch, or scikit-learn.\nFamiliarity with cloud platforms such as AWS, Azure, or Google Cloud.\nExcellent problem-solving skills and attention to detail.\nStrong communication skills and ability to work in a team environment.",
    "Primary Description": "Cognizant Technology Solutions · Remote",
    "Detail URL": "https://www.linkedin.com/jobs/view/4142506122",
    "Location": "Remote",
    "Skill": null,
    "Insight": null,
    "Job State": "LISTED",
    "Poster Id": 640138030.0,
    "Company Name": "Cognizant Technology Solutions",
    "Company Logo": "https://media.licdn.com/dms/image/C560BAQFfETfk4CxbTg/company-logo_400_400/company-logo_400_400/0/1720890643158/stattinc_logo?e=1747872000&v=beta&t=qZqFqh9VhdqCJd_c-1X8ujmRHqfnnPtJHcfurZKGQRk",      
    "Created At": "2025-02-05 18:53:31",
    "Scraped At": "2025-02-18 02:03:03"
    }